Repository: Serrauomo/Roomy-Journey-
Catalog: projectroom/Localizable.xcstrings
Source language: en
Languages: it

source: ...I have no idea what to wear. Maybe I could try something new, like a nice jacket, a shirt...
it: ...non ho idea di cosa indossare. Forse potrei provare qualcosa di nuovo, come una bella giacca, una camicia...

source: ...Then again, what would it cost me? I could simply disappear for the umpteenth time and not show up.
it: ...D'altra parte, cosa mi costerebbe? Potrei semplicemente sparire per l'ennesima volta e non farmi vedere.

source: ...well. I'd better leave early, it's a far place and I want to make sure I get there in time...
it: ...beh. È meglio che parta presto, è un posto lontano e voglio essere sicuro di arrivare in tempo...

source: ...What if I... make up some other excuse?
it: ...E se... inventassi qualche altra scusa?

source: All right. So I decided to go there.
it: Va bene. Così ho deciso di andarci.

source: But after all, what do I care? It is just a simple dinner, I would not miss anything...
it: Ma in fondo, che mi importa? È solo una semplice cena, non mi mancherebbe nulla...

source: But who am I kidding? Me, worrying about hurting them? They don't give a damn about me at all (although deep down I hope they do).
it: Ma chi voglio prendere in giro? Io che mi preoccupo di ferirli? A loro non importa nulla di me (anche se nel profondo spero che lo facciano).

source: For effort? That one does.
it: Per lo sforzo? Questo sì.

source: Hmm... However, others might be hurt. I might hurt them.
it: Hmm... Tuttavia, altri potrebbero essere feriti. Potrei far loro del male.

source: I have everything I need to be happy. Or at least, that's how I tell myself...
it: Ho tutto ciò che mi serve per essere felice. O almeno, è così che mi dico...

source: I haven't updated it in a while now; in fact, I've almost lost track of the days.
it: Ormai non lo aggiorno da un pò, in effetti ho quasi perso il conto dei giorni.

source: I should empty it out. But then I think, “What happens if I don't?” And the answer is: absolutely nothing. Perfect, I can put it off.
it: Dovrei svuotarlo. Ma poi penso: “cosa succede se non lo faccio?” E la risposta è: assolutamente niente. Perfetto, posso rimandare.

source: I still have the chat open actually, I've given my word by now, and then thinking about it I really want to go there.
it: Ho ancora la chat aperta in effetti, ormai ho dato la mia parola, e poi pensandoci voglio andarci davvero.

source: I think I'll go with my usual clothes. They make me feel safe.
it: Penso che userò i miei soliti vestiti. Mi fanno sentire al sicuro.

source: It seems a bit pointless to bring it just for headphones, maybe I could bring something to eat as well...
it: Sembra un pò inutile portarlo solo per le cuffie, forse potrei portare anche qualcosa da mangiare...

source: It's a simple outing, a simple dinner.
it: È una semplice uscita, una semplice cena.

source: Just take a simple breath, jump in and everything will be fine.
it: Basta solo prendere un semplice respiro, buttarsi e tutto andrà per il meglio.

source: Let me first check if I got everything, just in case.
it: Prima di tutto vorrei controllare se ho preso tutto, per sicurezza.

source: Let's see...
it: Vediamo…

source: Maybe I'll take a peek outside: Nothing extraordinary, although it looks like a beautiful day. Amazing that somewhere out there are people waiting for me.
it: Magari dò una sbirciatina fuori: Niente di straordinario, anche se sembra una bella giornata. Incredibile che da qualche parte là fuori ci siano persone che mi stanno aspettando.

source: My favorite game: Dark Sauce! How many hours will I have spent on it? Way too many, although I never get tired of it.
it: Il mio gioco preferito: Dark Sauce! Quante ore ci avrò passato? Decisamente troppe, anche se non mi stanca mai.

source: My old friends, should I bring them? It's still a nice subway ride, and my comfort music usually helps... Nha, it won't go like that! Right?
it: Le mie vecchie amiche, le porto? È comunque un bel viaggio in metro, e la mia musica di comfort aiuta di solito… Nha, non andrà così! Giusto?

source: my own space, my own passions, my own time... after all, every now and then even just that breeze coming from the window is enough to shake me for a moment.
it: il mio spazio, le mie passioni, il mio tempo... in fondo, ogni tanto anche solo la brezza che proviene dalla finestra basta a scuotermi per un attimo.

source: No, definitely not.
it: No, decisamente no.

source: Or I could use the usual “Steve” tactic, it's practically patented now.
it: Oppure potrei usare la solita tattica “Steve”, ormai praticamente brevettata.

source: So it's time, apparently.
it: Allora si va, a quanto pare.

source: Start
it: Inizia

source: Still undone, definitely too long ago. I really should do it again. Or I can leave it like that, I'll be back in a few hours anyway. Hmm, i think about it some more...
it: Ancora disfatto, decisamente da troppo tempo. Dovrei proprio rifarlo. O posso lasciarlo così, tanto tornerò in poche ore. Hmm, ci penso ancora un pò…

source: Thanks for Playing!
it: Grazie per aver giocato!

source: The only person I would really let down would be me. Again.
it: L'unica persona che deluderei davvero sarebbe me stessa. Di nuovo.

source: They've never even seen me, so how can I blame them after all.
it: Non mi hanno mai visto, quindi come posso biasimarli, dopotutto.

source: Too weird. Too different. Too 'not me.'
it: Troppo strano. Troppo diverso. Troppo “non io”.

source: TUTORIAL Tap on screen = Next Dialogue Tap on text = Complete Phrase
it: TUTORIAL Clicca su screen = Dialogo Successivo Clicca sul testo = Completa la Frase

source: Well now I'm forced to actually go, by now I've promised... Haven't I?
it: Beh, ora sono costretto ad andare davvero, ormai l'ho promesso... No?

source: Who would really care?
it: A chi interesserebbe davvero?

source: Why put so much effort into such stupidity? It's not like I should be rewarded for style.
it: Perché impegnarsi così tanto in una simile stupidità? Non è che dovrei essere premiato per lo stile.

source: Would my absence really hurt anyone? Funny, but from what they wrote it would seem so.
it: La mia assenza avrebbe davvero danneggiato qualcuno? Strano, ma da quello che hanno scritto sembrerebbe di sì.

source: Yes, I will stay home this time too. Nothing can go wrong here.
it: Sì, anche questa volta resterò a casa. Qui non c'è niente che possa andare storto.
